Revit 2024 API
GlazingTransmittanceColorType Enumeration
 The enumerated type representing the permitted values for the asset property "GlazingTransmittanceColor" from the "Glazing" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum GlazingTransmittanceColorType
Visual Basic
Public Enumeration GlazingTransmittanceColorType
Visual C++
public enum class GlazingTransmittanceColorType
Members
Member name | Description
Clear
Green
Gray
Blue
Bluegreen
Bronze
Custom
See Also
Autodesk.Revit.DB.Visual Namespace